create table board(
	id	int auto_increment primary key,
    title	varchar(100),
    pname	varchar(100),
    pw	varchar(100),
    upfile	varchar(100),
    content	varchar(9999),
    reg_date	timestamp,
    cnt	int,
    seq	int,
    lev	int,
    gid	int
);

insert into board (id, title, pname, pw, content, reg_date, cnt, seq, lev, gid) 
	values 
    (1, "첫글이다", "빈", "1111", "첫글내용", '2023-05-05', 0, 0, 0, 1),
    (2, "두글이다", "원빈", "1111", "두글내용", '2023-05-07', 0, 0, 0, 2),
    (3, "세글이다", "투빈", "1111", "세글내용", '2023-05-10', 0, 0, 0, 3),
    (4, "네글이다", "골빈", "1111", "네글내용", '2023-05-12', 0, 0, 0, 4),
    (5, "오글이다", "장희빈", "1111", "오글내용", '2023-05-19', 0, 0, 0, 5);
    
select * from board;

select max(id) from board;

insert into board (id, title, pname, pw, content, reg_date, cnt, seq, lev, gid) 
	values 
    (21, "첫글이다", "빈", "1111", "첫글내용", '2023-06-05', 0, 0, 0, 21),
    (22, "두글이다", "원빈", "1111", "두글내용", '2023-06-07', 0, 0, 0, 22),
    (23, "세글이다", "투빈", "1111", "세글내용", '2023-06-10', 0, 0, 0, 23),
    (24, "네글이다", "골빈", "1111", "네글내용", '2023-06-12', 0, 0, 0, 24),
    (25, "오글이다", "장희빈", "1111", "오글내용", '2023-06-19', 0, 0, 0, 25),
    (26, "첫글이다", "빈", "1111", "첫글내용", '2023-06-05', 0, 0, 0, 26),
    (27, "두글이다", "원빈", "1111", "두글내용", '2023-06-07', 0, 0, 0, 27),
    (28, "세글이다", "투빈", "1111", "세글내용", '2023-06-10', 0, 0, 0, 28),
    (29, "네글이다", "골빈", "1111", "네글내용", '2023-06-12', 0, 0, 0, 29),
    (30, "오글이다", "장희빈", "1111", "오글내용", '2023-06-19', 0, 0, 0, 30);
insert into board (id, title, pname, pw, content, reg_date, cnt, seq, lev, gid) 
	values 
    (31, "첫글이다", "빈", "1111", "첫글내용", '2023-06-05', 0, 0, 0, 31),
    (32, "두글이다", "원빈", "1111", "두글내용", '2023-06-07', 0, 0, 0, 32),
    (33, "세글이다", "투빈", "1111", "세글내용", '2023-06-10', 0, 0, 0, 33),
    (34, "네글이다", "골빈", "1111", "네글내용", '2023-06-12', 0, 0, 0, 34),
    (35, "오글이다", "장희빈", "1111", "오글내용", '2023-06-19', 0, 0, 0, 35),
    (36, "첫글이다", "빈", "1111", "첫글내용", '2023-06-05', 0, 0, 0, 36),
    (37, "두글이다", "원빈", "1111", "두글내용", '2023-06-07', 0, 0, 0, 37),
    (38, "세글이다", "투빈", "1111", "세글내용", '2023-06-10', 0, 0, 0, 38),
    (39, "네글이다", "골빈", "1111", "네글내용", '2023-06-12', 0, 0, 0, 39),
    (40, "오글이다", "장희빈", "1111", "오글내용", '2023-06-19', 0, 0, 0, 40);
insert into board (id, title, pname, pw, content, reg_date, cnt, seq, lev, gid) 
	values 
    (41, "첫글이다", "빈", "1111", "첫글내용", '2023-06-05', 0, 0, 0, 41),
    (42, "두글이다", "원빈", "1111", "두글내용", '2023-06-07', 0, 0, 0, 42),
    (43, "세글이다", "투빈", "1111", "세글내용", '2023-06-10', 0, 0, 0, 43),
    (44, "네글이다", "골빈", "1111", "네글내용", '2023-06-12', 0, 0, 0, 44),
    (45, "오글이다", "장희빈", "1111", "오글내용", '2023-06-19', 0, 0, 0, 45),
    (46, "첫글이다", "빈", "1111", "첫글내용", '2023-06-05', 0, 0, 0, 46),
    (47, "두글이다", "원빈", "1111", "두글내용", '2023-06-07', 0, 0, 0, 47),
    (48, "세글이다", "투빈", "1111", "세글내용", '2023-06-10', 0, 0, 0, 48),
    (49, "네글이다", "골빈", "1111", "네글내용", '2023-06-12', 0, 0, 0, 49),
    (50, "오글이다", "장희빈", "1111", "오글내용", '2023-06-19', 0, 0, 0, 50);
